# BasicLossFactor Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BasicLossFactor Constructor
BasicLossFactor Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BasicLossFactor()()()() | Creates a basic loss factor object with no loss. |
| BasicLossFactor(Double) | Creates a basic loss factor object with the given value. |
| BasicLossFactor(BasicLossFactor) | Creates a copy of the given basic loss factor object |

# See Also
BasicLossFactor Class
BasicLossFactor Members
Autodesk.Revit.DB.Lighting Namespace